; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-74)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b16)
    (on b16 b13)
    (on b13 b1)
    (on b1 b20)
    (on b20 b9)
    (on b9 b3)
    (on b3 b17)
    (on b17 b22)
    (on b22 b6)
    (on b6 b14)
    (on b14 b8)
    (on b8 b5)
    (on b5 b4)
    (on b4 b10)
    (on b10 b21)
    (on b21 b2)
    (on b2 b15)
    (on b15 b12)
    (on b12 b18)
    (on b18 b7)
    (on b7 b19)
    (on-table b19))
 (:goal (and 
(on-table b19)
(on-table b13)
(on-table b20)
(on b6 b20)
(on b14 b13)
))
)

; plan
1. (unstack b11 b16)
   deleted: (on b11 b16) (clear b11) (arm-empty)
   added: (holding b11) (clear b16)
   goals met: 1 of 5
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 5
3. (unstack b16 b13)
   deleted: (on b16 b13) (clear b16) (arm-empty)
   added: (holding b16) (clear b13)
   goals met: 1 of 5
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 5
5. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 1 of 5
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 5
7. (unstack b1 b20)
   deleted: (on b1 b20) (clear b1) (arm-empty)
   added: (holding b1) (clear b20)
   goals met: 2 of 5
8. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 5
9. (unstack b20 b9)
   deleted: (on b20 b9) (clear b20) (arm-empty)
   added: (holding b20) (clear b9)
   goals met: 2 of 5
10. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 3 of 5
11. (unstack b9 b3)
   deleted: (on b9 b3) (clear b9) (arm-empty)
   added: (holding b9) (clear b3)
   goals met: 3 of 5
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 5
13. (unstack b3 b17)
   deleted: (on b3 b17) (clear b3) (arm-empty)
   added: (holding b3) (clear b17)
   goals met: 3 of 5
14. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 5
15. (unstack b17 b22)
   deleted: (on b17 b22) (clear b17) (arm-empty)
   added: (holding b17) (clear b22)
   goals met: 3 of 5
16. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 3 of 5
17. (unstack b22 b6)
   deleted: (on b22 b6) (clear b22) (arm-empty)
   added: (holding b22) (clear b6)
   goals met: 3 of 5
18. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 3 of 5
19. (unstack b6 b14)
   deleted: (on b6 b14) (clear b6) (arm-empty)
   added: (holding b6) (clear b14)
   goals met: 3 of 5
20. (stack b6 b20)
   deleted: (clear b20) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b20)
   goals met: 4 of 5
21. (unstack b14 b8)
   deleted: (on b14 b8) (clear b14) (arm-empty)
   added: (holding b14) (clear b8)
   goals met: 4 of 5
22. (stack b14 b13)
   deleted: (clear b13) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b13)
   goals met: 5 of 5
